chenhongbin1994/autool/PT50摩托车四缸平衡仪表/模组驱动/IAP/STM32F103IAP- V1_mid/MyCode/oled.h
#ifndef __OLED_H
#define __OLED_H 


#include "stdlib.h"	
#include "stm32f10x.h"

//-----------------测试LED端口定义---------------- 

#define LED_ON GPIO_ResetBits(GPIOC,GPIO_Pin_12)
#define LED_OFF GPIO_SetBits(GPIOC,GPIO_Pin_12)

//-----------------OLED端口定义---------------- 

#define OLED_SCL_Clr() GPIO_ResetBits(GPIOC,GPIO_Pin_4)//SCL
#define OLED_SCL_Set() GPIO_SetBits(GPIOC,GPIO_Pin_4)

#define OLED_SDA_Clr() GPIO_ResetBits(GPIOC,GPIO_Pin_5)//SDA
#define OLED_SDA_Set() GPIO_SetBits(GPIOC,GPIO_Pin_5)

#define OLED_RES_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_0)//RES
#define OLED_RES_Set() GPIO_SetBits(GPIOB,GPIO_Pin_0)

#define OLED_DC_Clr()  GPIO_ResetBits(GPIOB,GPIO_Pin_1)//DC
#define OLED_DC_Set()  GPIO_SetBits(GPIOB,GPIO_Pin_1)

#define OLED_CS_Clr()  GPIO_ResetBits(GPIOA,GPIO_Pin_4)//CS
#define OLED_CS_Set()  GPIO_SetBits(GPIOA,GPIO_Pin_4)


#define OLED_CMD  0	//写命令
#define OLED_DATA 1	//写数据

#define  u8  uint8_t
#define  u32  uint32_t


void OLED_ClearPoint(u8 x,u8 y);
void OLED_ColorTurn(u8 i);
void OLED_DisplayTurn(u8 i);
void OLED_WR_Byte(u8 dat,u8 mode);
void OLED_DisPlay_On(void);
void OLED_DisPlay_Off(void);
void OLED_Refresh(void);
void OLED_Clear(void);
void OLED_DrawPoint(u8 x,u8 y,u8 t);
void OLED_DrawLine(u8 x1,u8 y1,u8 x2,u8 y2,u8 mode);
void OLED_DrawCircle(u8 x,u8 y,u8 r);
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 size1,u8 mode);
void OLED_ShowChar6x8(u8 x,u8 y,u8 chr,u8 mode);
void OLED_ShowString(u8 x,u8 y,u8 *chr,u8 size1,u8 mode);
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size1,u8 mode);
void OLED_ShowChinese(u8 x,u8 y,u8 num,u8 size1,u8 mode);
void OLED_ScrollDisplay(u8 num,u8 space,u8 mode);
void OLED_ShowPicture(u8 x,u8 y,u8 sizex,u8 sizey,u8 BMP[],u8 mode);
void OLED_Init(void);

#endif

